Revit 2026 API

# UIFabricationUtilsSetOpenConnectorIndicatorAwayColor Method

---

Sets the color of the open connector indicator in away direction

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetOpenConnectorIndicatorAwayColor(
	Color color
)
```
```vb
Public Shared Sub SetOpenConnectorIndicatorAwayColor (
	color As Color
)
```
```cpp
public:
static void SetOpenConnectorIndicatorAwayColor(
	Color^ color
)
```
```fsharp
static member SetOpenConnectorIndicatorAwayColor :
        color : Color -> unit
```

#### Parameters

color Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UIFabricationUtils Class

Autodesk.Revit.UI Namespace